---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SubRegionFailures.CreateSubRegionFailed
source: html/5e5b3a13-20b0-1b4d-1724-05c2a60e06fd.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SubRegionFailures.CreateSubRegionFailed Property

Create sub-division failed.

## Syntax (C#)
```csharp
public static FailureDefinitionId CreateSubRegionFailed { get; }
```